app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 12 Feb 2014 12:02:56 UTC +00:00], ["text", "mierda1"], ["title", "Ñordo1"], ["updated_at", Wed, 12 Feb 2014 12:02:56 UTC +00:00]]
---
	def create
		@post = Post.new(params[:post].permit(:title, :text))


		if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = 2  [["title", "Prueba 2"], ["text", "<p>Primer parrafo\r\n</p>\r\n<p>\r\nSegundo parrafo</p>"], ["updated_at", Mon, 19 May 2014 14:06:40 UTC +00:00]]
---
	def update
		@post = Post.find(params[:id])

		if @post.update(params[:post].permit(:title, :text))