app/controllers/welcome_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT 1
---
  def index
  	redirect_to post_path(Post.last) and return